-- 数据初始化

-- ----------------------------
-- Records of auth_group
-- ----------------------------
INSERT INTO auth_group VALUES (1, 'normaluser');

-- ----------------------------
-- Records of auth_permission
-- ----------------------------
INSERT INTO `auth_permission` VALUES ('1', 'Can add permission', '1', 'add_permission');
INSERT INTO `auth_permission` VALUES ('2', 'Can change permission', '1', 'change_permission');
INSERT INTO `auth_permission` VALUES ('3', 'Can delete permission', '1', 'delete_permission');
INSERT INTO `auth_permission` VALUES ('4', 'Can add group', '2', 'add_group');
INSERT INTO `auth_permission` VALUES ('5', 'Can change group', '2', 'change_group');
INSERT INTO `auth_permission` VALUES ('6', 'Can delete group', '2', 'delete_group');
INSERT INTO `auth_permission` VALUES ('7', 'Can add user', '3', 'add_user');
INSERT INTO `auth_permission` VALUES ('8', 'Can change user', '3', 'change_user');
INSERT INTO `auth_permission` VALUES ('9', 'Can delete user', '3', 'delete_user');
INSERT INTO `auth_permission` VALUES ('10', 'Can add content type', '4', 'add_contenttype');
INSERT INTO `auth_permission` VALUES ('11', 'Can change content type', '4', 'change_contenttype');
INSERT INTO `auth_permission` VALUES ('12', 'Can delete content type', '4', 'delete_contenttype');
INSERT INTO `auth_permission` VALUES ('13', 'Can add session', '5', 'add_session');
INSERT INTO `auth_permission` VALUES ('14', 'Can change session', '5', 'change_session');
INSERT INTO `auth_permission` VALUES ('15', 'Can delete session', '5', 'delete_session');
INSERT INTO `auth_permission` VALUES ('16', 'Can add site', '6', 'add_site');
INSERT INTO `auth_permission` VALUES ('17', 'Can change site', '6', 'change_site');
INSERT INTO `auth_permission` VALUES ('18', 'Can delete site', '6', 'delete_site');
INSERT INTO `auth_permission` VALUES ('19', 'Can add log entry', '7', 'add_logentry');
INSERT INTO `auth_permission` VALUES ('20', 'Can change log entry', '7', 'change_logentry');
INSERT INTO `auth_permission` VALUES ('21', 'Can delete log entry', '7', 'delete_logentry');
INSERT INTO `auth_permission` VALUES ('22', 'Can add skill group', '8', 'add_skillgroup');
INSERT INTO `auth_permission` VALUES ('23', 'Can change skill group', '8', 'change_skillgroup');
INSERT INTO `auth_permission` VALUES ('24', 'Can delete skill group', '8', 'delete_skillgroup');
INSERT INTO `auth_permission` VALUES ('25', 'Can add skill', '9', 'add_skill');
INSERT INTO `auth_permission` VALUES ('26', 'Can change skill', '9', 'change_skill');
INSERT INTO `auth_permission` VALUES ('27', 'Can delete skill', '9', 'delete_skill');
INSERT INTO `auth_permission` VALUES ('28', 'Can add 账号', '10', 'add_account');
INSERT INTO `auth_permission` VALUES ('29', 'Can change 账号', '10', 'change_account');
INSERT INTO `auth_permission` VALUES ('30', 'Can delete 账号', '10', 'delete_account');
INSERT INTO `auth_permission` VALUES ('31', 'Can add 角色', '11', 'add_character');
INSERT INTO `auth_permission` VALUES ('32', 'Can change 角色', '11', 'change_character');
INSERT INTO `auth_permission` VALUES ('33', 'Can delete 角色', '11', 'delete_character');
INSERT INTO `auth_permission` VALUES ('34', 'Can add 角色技能', '12', 'add_character_skills');
INSERT INTO `auth_permission` VALUES ('35', 'Can change 角色技能', '12', 'change_character_skills');
INSERT INTO `auth_permission` VALUES ('36', 'Can delete 角色技能', '12', 'delete_character_skills');

-- ----------------------------
-- Records of auth_group_permissions
-- ----------------------------
INSERT INTO auth_group_permissions VALUES (1, 1, 31);
INSERT INTO auth_group_permissions VALUES (2, 1, 32);
INSERT INTO auth_group_permissions VALUES (3, 1, 33);

-- ----------------------------
-- Records of auth_user
-- ----------------------------
INSERT INTO `auth_user` VALUES ('1', 'root', '', '', 'root@1.cc', 'pbkdf2_sha256$10000$Qqx2h0Yrd8kc$x0g8FqNQANHA6FZMsgYdP3c1kbx4jCQwwWdRKpOQ2Eg=', '1', '1', '1', '2014-03-26 16:03:04', '2014-03-26 16:03:04');

-- ----------------------------
-- Records of datas_account
-- ----------------------------
INSERT INTO `datas_account` VALUES ('1', '1', 'a');

-- ----------------------------
-- Records of datas_character
-- ----------------------------
INSERT INTO `datas_character` VALUES ('1', '1', '测试角色', '20', '20', '20', '20', '19', null, null, null, null, null);

-- SkillGroup
-- 	SELECT
-- 		',(''' + CAST (groupID AS VARCHAR) + ''', ''' + ISNULL(t.[text], groupName) + ''')' AS insert_sql
-- 	FROM
-- 		invGroups g
-- 	LEFT JOIN trnTranslations t ON (
-- 		g.groupID = t.keyID
-- 		AND t.tcID = 7
-- 		AND t.languageID = 'ZH'
-- 	)
-- 	WHERE
-- 		categoryID = 16 -- Skills
-- 	AND groupID <> 505 -- Fake Skills
-- 	ORDER BY
-- 		groupID
INSERT INTO datas_skillgroup (id, group_name) VALUES 
 ('255', '射击学')
,('256', '导弹')
,('257', '飞船操控学')
,('258', '领导学')
,('266', '军团管理')
,('268', '生产')
,('269', '改装件')
,('270', '科学')
,('272', '电子系统')
,('273', '无人机')
,('274', '贸易学')
,('275', '导航学')
,('278', '社会学')
,('1209', '护盾')
,('1210', '装甲')
,('1213', '锁定系统')
,('1216', '工程学')
,('1217', '扫描')
,('1218', '资源处理')
,('1220', '神经增强')
,('1240', '子系统')
,('1241', '行星管理');

-- Skill
-- 	SELECT
-- 		',(''' + CAST (i.typeID AS VARCHAR) + ''', ''' + LTRIM(RTRIM(ISNULL(t.[text], i.typeName))) + ''', ''' + CAST (g.groupID AS VARCHAR) + ''', ''' + CAST (d.valueFloat AS VARCHAR) + ''')' AS insert_sql
-- 	FROM
-- 		invTypes i
-- 	INNER JOIN invGroups g ON (i.groupID = g.groupID)
-- 	INNER JOIN dgmTypeAttributes d ON (i.typeID = d.typeID)
-- 	LEFT JOIN trnTranslations t ON (
-- 		i.typeID = t.keyID
-- 		AND t.tcID = 8
-- 		AND t.languageID = 'ZH'
-- 	)
-- 	WHERE
-- 		g.categoryID = 16 -- Skills
-- 	AND i.published = 1
-- 	AND d.attributeID = 275 -- Skill Rank
-- 	AND d.valueFloat IS NOT NULL
-- 	ORDER BY
-- 		i.typeID
INSERT INTO datas_skill (id, skill_name, skill_group_id, skill_rank) VALUES 
 ('2403', '高级行星学', '1241', '5')
,('2406', '行星学', '1241', '3')
,('2495', '行星统筹管理学', '1241', '4')
,('2505', '指挥中心升级理论', '1241', '4')
,('3184', '联合矿业工业舰操作', '257', '4')
,('3300', '射击学', '255', '1')
,('3301', '小型混合炮台研究', '255', '1')
,('3302', '小型射弹炮台研究', '255', '1')
,('3303', '小型能量炮台研究', '255', '1')
,('3304', '中型混合炮台研究', '255', '3')
,('3305', '中型射弹炮台研究', '255', '3')
,('3306', '中型能量炮台研究', '255', '3')
,('3307', '大型混合炮台研究', '255', '5')
,('3308', '大型射弹炮台研究', '255', '5')
,('3309', '大型能量炮台研究', '255', '5')
,('3310', '高速射击理论', '255', '2')
,('3311', '精确射击理论', '255', '2')
,('3312', '航迹预算学', '255', '2')
,('3315', '外科手术打击理论', '255', '4')
,('3316', '受控点射理论', '255', '2')
,('3317', '弹道分析学', '255', '5')
,('3318', '武器升级研究', '1216', '2')
,('3319', '导弹发射器操作', '256', '1')
,('3320', '火箭概论', '256', '1')
,('3321', '轻型导弹概论', '256', '2')
,('3322', '自动锁定导弹', '256', '3')
,('3323', '反弹道导弹理论', '256', '2')
,('3324', '重型导弹概论', '256', '3')
,('3325', '鱼雷概论', '256', '4')
,('3326', '巡航导弹概论', '256', '5')
,('3327', '飞船操控学', '257', '1')
,('3328', '盖伦特护卫舰操作', '257', '2')
,('3329', '米玛塔尔护卫舰操作', '257', '2')
,('3330', '加达里护卫舰操作', '257', '2')
,('3331', '艾玛护卫舰操作', '257', '2')
,('3332', '盖伦特巡洋舰操作', '257', '5')
,('3333', '米玛塔尔巡洋舰操作', '257', '5')
,('3334', '加达里巡洋舰操作', '257', '5')
,('3335', '艾玛巡洋舰操作', '257', '5')
,('3336', '盖伦特战列舰操作', '257', '8')
,('3337', '米玛塔尔战列舰操作', '257', '8')
,('3338', '加达里战列舰操作', '257', '8')
,('3339', '艾玛战列舰操作', '257', '8')
,('3340', '盖伦特工业舰操作', '257', '4')
,('3341', '米玛塔尔工业舰操作', '257', '4')
,('3342', '加达里工业舰操作', '257', '4')
,('3343', '艾玛工业舰操作', '257', '4')
,('3344', '盖伦特泰坦操作', '257', '16')
,('3345', '米玛塔尔泰坦操作', '257', '16')
,('3346', '加达里泰坦操作', '257', '16')
,('3347', '艾玛泰坦操作', '257', '16')
,('3348', '领导理论', '258', '1')
,('3349', '游击战理论', '258', '2')
,('3350', '会战理论', '258', '2')
,('3351', '会战专业研究', '258', '5')
,('3352', '信息战专业研究', '258', '5')
,('3354', '作战网络专业研究', '258', '6')
,('3355', '社会学', '278', '1')
,('3356', '谈判技巧', '278', '2')
,('3357', '外交学', '278', '1')
,('3358', '高级沟通技巧', '278', '4')
,('3359', '关系学', '278', '3')
,('3361', '犯罪关系研究', '278', '3')
,('3363', '军团管理培训', '266', '1')
,('3368', '外交关系学', '266', '2')
,('3373', '母星防御控制管理', '266', '7')
,('3380', '工业理论', '268', '1')
,('3385', '提炼学概论', '1218', '1')
,('3386', '采矿技术', '1218', '1')
,('3387', '批量生产学', '268', '2')
,('3388', '高级工业理论', '268', '3')
,('3389', '提炼效率理论', '1218', '3')
,('3392', '机械学', '1210', '1')
,('3393', '维修系统理论', '1210', '1')
,('3394', '船体加固理论', '1210', '2')
,('3395', '高级小型舰船建造研究', '268', '2')
,('3396', '高级工业舰船建造研究', '268', '3')
,('3397', '高级中型舰船建造研究', '268', '5')
,('3398', '高级大型舰船建造研究', '268', '8')
,('3400', '哨站建造研究', '268', '16')
,('3402', '科学原理', '270', '1')
,('3403', '研究概论', '270', '1')
,('3405', '生物学', '1220', '1')
,('3406', '实验室运作理论', '270', '1')
,('3408', '冬眠者加密技术原理', '270', '4')
,('3409', '冶金学', '270', '3')
,('3410', '太空地质学', '1218', '3')
,('3411', '控制论', '1220', '3')
,('3412', '太空测量学', '1217', '3')
,('3413', '能量栅格管理学', '1216', '1')
,('3416', '护盾操作', '1209', '1')
,('3417', '电容系统操作', '1216', '1')
,('3418', '电容管理学', '1216', '3')
,('3419', '护盾管理', '1209', '3')
,('3420', '战术护盾操控', '1209', '4')
,('3421', '能量脉冲武器', '1216', '2')
,('3422', '护盾频散系统', '1209', '2')
,('3423', '电容散发系统研究', '1216', '2')
,('3424', '能量栅格提升', '1216', '2')
,('3425', '护盾提升', '1209', '2')
,('3426', 'CPU管理学', '1216', '1')
,('3427', '电子战理论', '272', '2')
,('3428', '远距锁定研究', '1213', '2')
,('3429', '目标锁定训练', '1213', '1')
,('3430', '高级目标锁定训练', '1213', '3')
,('3431', '信号分析学', '1213', '1')
,('3432', '电子升级研究', '1216', '2')
,('3433', '感应器链研究', '272', '3')
,('3434', '武器干扰研究', '272', '3')
,('3435', '推进阻扰理论', '272', '3')
,('3436', '无人机概论', '273', '1')
,('3437', '无人机电子理论', '273', '1')
,('3438', '采矿无人机操控理论', '273', '2')
,('3439', '维修无人机操控理论', '273', '3')
,('3440', '打捞无人机操控理论', '273', '4')
,('3441', '重型无人机操控理论', '273', '5')
,('3442', '无人机控制理论', '273', '5')
,('3443', '贸易学', '274', '1')
,('3444', '零售技巧', '274', '2')
,('3446', '经纪人关系学', '274', '2')
,('3447', '市场观测学', '274', '3')
,('3449', '导航学', '275', '1')
,('3450', '加力燃烧器原理', '275', '1')
,('3451', '燃料节约技术', '275', '2')
,('3452', '加速控制理论', '275', '4')
,('3453', '规避机动理论', '275', '2')
,('3454', '高速机动理论', '275', '5')
,('3455', '跃迁引擎操控基础', '275', '1')
,('3456', '跳跃引擎操作理论', '275', '5')
,('3551', '测量学', '1217', '1')
,('3731', '大型军团管理培训', '266', '3')
,('3732', '高级军团管理培训', '266', '5')
,('3893', '采矿关系学', '278', '2')
,('3894', '物流关系学', '278', '2')
,('3895', '安全关系学', '278', '2')
,('4385', '微型跳跃引擎操作', '275', '5')
,('4411', '目标锁定扰断训练', '272', '5')
,('11082', '小型磁轨炮专业研究', '255', '3')
,('11083', '小型集束激光专业研究', '255', '3')
,('11084', '小型自动加农炮专业研究', '255', '3')
,('11207', '高级武器升级研究', '1216', '6')
,('11395', '深核开采法研究', '1218', '6')
,('11433', '高能物理学', '270', '5')
,('11441', '等离子物理学', '270', '5')
,('11442', '纳米工程学', '270', '5')
,('11443', '磁流体物理学', '270', '5')
,('11444', '艾玛星舰工程学', '270', '5')
,('11445', '米玛塔尔星舰工程学', '270', '5')
,('11446', '引力子物理学', '270', '5')
,('11447', '激光物理学', '270', '5')
,('11448', '电磁物理学', '270', '5')
,('11449', '火箭科学', '270', '5')
,('11450', '盖伦特星舰工程学', '270', '5')
,('11451', '核芯物理学', '270', '5')
,('11452', '机械工程学', '270', '5')
,('11453', '电子工程学', '270', '5')
,('11454', '加达里星舰工程学', '270', '5')
,('11455', '量子物理学', '270', '5')
,('11487', '空间航行工程学', '270', '5')
,('11529', '分子工程学', '270', '5')
,('11566', '热能护盾补偿', '1209', '2')
,('11569', '装甲战专业研究', '258', '5')
,('11572', '游击战专业研究', '258', '5')
,('11574', '联队指挥学', '258', '8')
,('11579', '隐形理论', '272', '6')
,('11584', '空间定锚', '266', '3')
,('12092', '截击舰操作', '257', '4')
,('12093', '隐形特勤舰操作', '257', '4')
,('12095', '突击护卫舰操作', '257', '4')
,('12096', '后勤舰操作', '257', '6')
,('12098', '拦截舰操作', '257', '5')
,('12179', '研究工程管理学', '270', '8')
,('12180', '艾克诺处理技术', '1218', '4')
,('12181', '双多特处理技术', '1218', '4')
,('12182', '克洛基处理技术', '1218', '4')
,('12183', '黑赭石处理技术', '1218', '3')
,('12184', '片麻岩处理技术', '1218', '3')
,('12185', '同位原矿处理技术', '1218', '3')
,('12186', '希莫非特处理技术', '1218', '2')
,('12187', '杰斯贝矿处理技术', '1218', '2')
,('12188', '水硼砂处理技术', '1218', '2')
,('12189', '基腹断岩处理技术', '1218', '5')
,('12190', '奥贝尔石处理技术', '1218', '2')
,('12191', '斜长岩处理技术', '1218', '1')
,('12192', '干焦岩处理技术', '1218', '1')
,('12193', '灼烧岩处理技术', '1218', '1')
,('12194', '灰岩处理技术', '1218', '3')
,('12195', '凡晶石处理技术', '1218', '1')
,('12196', '碎铁处理技术', '1218', '5')
,('12201', '小型火炮专业研究', '255', '3')
,('12202', '中型火炮专业研究', '255', '5')
,('12203', '大型火炮专业研究', '255', '8')
,('12204', '中型集束激光专业研究', '255', '5')
,('12205', '大型集束激光专业研究', '255', '8')
,('12206', '中型磁轨炮专业研究', '255', '5')
,('12207', '大型磁轨炮专业研究', '255', '8')
,('12208', '中型自动加农炮专业研究', '255', '5')
,('12209', '大型自动加农炮专业研究', '255', '8')
,('12210', '小型疾速炮专业研究', '255', '3')
,('12211', '中型疾速炮专业研究', '255', '5')
,('12212', '大型疾速炮专业研究', '255', '8')
,('12213', '小型脉冲激光专业研究', '255', '3')
,('12214', '中型脉冲激光专业研究', '255', '5')
,('12215', '大型脉冲激光专业研究', '255', '8')
,('12241', '超大型军团管理培训', '266', '8')
,('12305', '无人机导航学', '273', '1')
,('12365', '电磁护盾补偿', '1209', '2')
,('12366', '动能护盾补偿', '1209', '2')
,('12367', '爆炸护盾补偿', '1209', '2')
,('12441', '导弹打击概论', '256', '2')
,('12442', '导弹动力学', '256', '4')
,('12484', '艾玛无人机专业研究', '273', '5')
,('12485', '米玛塔尔无人机专业研究', '273', '5')
,('12486', '盖伦特无人机专业研究', '273', '5')
,('12487', '加达里无人机专业研究', '273', '5')
,('13278', '考古学', '1217', '3')
,('13279', '遥测感应技术', '1241', '1')
,('16069', '远程装甲维修系统研究', '1210', '2')
,('16281', '冰矿采集理论', '1218', '1')
,('16591', '重型突击巡洋舰操作', '257', '6')
,('16594', '供给学', '274', '3')
,('16595', '投机技巧', '274', '1')
,('16596', '批发技巧', '274', '4')
,('16597', '风险投资技巧', '274', '3')
,('16598', '市场学', '274', '3')
,('16622', '会计学', '274', '3')
,('17940', '采矿驳船操作', '257', '4')
,('18025', '冰矿处理技术', '1218', '5')
,('18580', '商业巨头', '274', '6')
,('19719', '运输舰操作', '257', '6')
,('19759', '远距干扰学', '272', '4')
,('19760', '频率调制理论', '272', '3')
,('19761', '信号频散学', '272', '5')
,('19766', '信号压制原理', '272', '5')
,('19767', '炮塔反稳定对抗', '272', '5')
,('19921', '目标标记研究', '272', '3')
,('19922', '信号聚焦研究', '272', '5')
,('20209', '火箭专业研究', '256', '3')
,('20210', '轻型导弹专业研究', '256', '3')
,('20211', '重型导弹专业研究', '256', '5')
,('20212', '巡航导弹专业研究', '256', '8')
,('20213', '鱼雷专业研究', '256', '8')
,('20312', '制导导弹精确打击理论', '256', '5')
,('20314', '目标导航预测学', '256', '2')
,('20315', '战斗部升级研究', '256', '5')
,('20327', '旗舰级能量炮台研究', '255', '7')
,('20342', '高级飞船操控学', '257', '5')
,('20433', '塔洛迦技术研究', '270', '5')
,('20494', '装甲战理论', '258', '2')
,('20495', '信息战理论', '258', '2')
,('20524', '艾玛货舰操作', '257', '10')
,('20525', '艾玛无畏舰操作', '257', '12')
,('20526', '加达里货舰操作', '257', '10')
,('20527', '盖伦特货舰操作', '257', '10')
,('20528', '米玛塔尔货舰操作', '257', '10')
,('20530', '加达里无畏舰操作', '257', '12')
,('20531', '盖伦特无畏舰操作', '257', '12')
,('20532', '米玛塔尔无畏舰操作', '257', '12')
,('20533', '旗舰级舰船操作', '257', '14')
,('21059', '护盾补偿', '1209', '2')
,('21071', '导弹发射效率', '256', '2')
,('21603', '诱导力场理论', '275', '5')
,('21610', '跳跃引擎燃料节约技术', '275', '8')
,('21611', '跳跃引擎校对理论', '275', '9')
,('21666', '旗舰级混合炮台研究', '255', '7')
,('21667', '旗舰级射弹炮台研究', '255', '7')
,('21668', '堡垒级鱼雷理论', '256', '7')
,('21718', '电脑破译原理', '1217', '3')
,('21789', '冬眠者技术研究', '270', '5')
,('21790', '加达里加密技术原理', '270', '5')
,('21791', '米玛塔尔加密技术原理', '270', '5')
,('21802', '旗舰级护盾操作', '1209', '8')
,('21803', '旗舰维修系统研究', '1210', '8')
,('22043', '战术武器配置理论', '255', '8')
,('22242', '旗舰级船只建造研究', '268', '14')
,('22536', '开采先锋技术', '258', '2')
,('22551', '采掘者操作', '257', '5')
,('22552', '采矿管理技术', '258', '5')
,('22578', '矿冶提升理论', '1218', '4')
,('22761', '侦察舰操作', '257', '6')
,('22806', '电磁装甲补偿理论', '1210', '2')
,('22807', '爆炸装甲补偿理论', '1210', '2')
,('22808', '动能装甲补偿理论', '1210', '2')
,('22809', '热能装甲补偿理论', '1210', '2')
,('23069', '铁骑舰载机操控理论', '273', '12')
,('23087', '艾玛加密技术原理', '270', '5')
,('23121', '盖伦特加密技术原理', '270', '5')
,('23123', '塔克玛技术研究', '270', '5')
,('23124', '燕军技术研究', '270', '5')
,('23566', '高级无人机电子理论', '273', '5')
,('23594', '岗哨无人机操控理论', '273', '5')
,('23606', '无人机精准射击', '273', '1')
,('23618', '无人机效能研究', '273', '5')
,('23950', '指挥舰操作', '257', '8')
,('24241', '轻型无人机操控理论', '273', '1')
,('24242', '坚韧心理学', '1220', '1')
,('24268', '供给链管理', '268', '3')
,('24270', '科学网络学', '270', '3')
,('24311', '艾玛航空母舰操作', '257', '14')
,('24312', '加达里航空母舰操作', '257', '14')
,('24313', '盖伦特航空母舰操作', '257', '14')
,('24314', '米玛塔尔航空母舰操作', '257', '14')
,('24562', '跳跃通道发生学', '275', '14')
,('24563', '末日武器操作技术', '255', '14')
,('24568', '旗舰级远程装甲修理技术', '1210', '10')
,('24571', '旗舰级护盾频散系统', '1209', '10')
,('24572', '旗舰级电容散发系统研究', '1216', '10')
,('24606', '克隆设施运作技术', '1220', '10')
,('24613', '高级无人机接口技术', '273', '8')
,('24624', '高级实验室运作理论', '270', '8')
,('24625', '高级量产技术', '268', '8')
,('24764', '舰队指挥学', '258', '12')
,('25233', '军团合同规则', '274', '3')
,('25235', '合同规则', '274', '1')
,('25530', '神经毒化抵抗理论', '1220', '5')
,('25538', '神经毒化控制理论', '1220', '2')
,('25544', '气云采集理论', '1218', '1')
,('25718', '重型攻击导弹专业研究', '256', '5')
,('25719', '重型攻击导弹概论', '256', '3')
,('25739', '天文测距学', '1217', '8')
,('25810', '定点测量学', '1217', '5')
,('25811', '天文探测学', '1217', '5')
,('25863', '打捞回收技术', '1218', '3')
,('26224', '药品制备', '268', '2')
,('26252', '构件改装技术', '269', '2')
,('26253', '装甲改装技术', '269', '3')
,('26254', '空间航行改装技术', '269', '3')
,('26255', '无人机改装技术', '269', '3')
,('26256', '电子优势改装技术', '269', '3')
,('26257', '射弹武器改装技术', '269', '3')
,('26258', '能量武器改装技术', '269', '3')
,('26259', '混合武器改装技术', '269', '3')
,('26260', '发射器改装技术', '269', '3')
,('26261', '护盾改造技术', '269', '3')
,('27902', '远程船体维修系统研究', '1210', '2')
,('27906', '战术后勤控制理论', '272', '8')
,('27911', '投射型ECM理论', '272', '8')
,('27936', '旗舰级远程船体修理技术', '1210', '10')
,('28073', '炸弹部署理论', '256', '4')
,('28164', '热力学', '1216', '3')
,('28374', '旗舰级工业舰操作', '257', '12')
,('28585', '工业配置技术', '1218', '8')
,('28609', '重型拦截巡洋舰操作', '257', '6')
,('28615', '电子攻击舰操作', '257', '4')
,('28656', '黑隐特勤舰操作', '257', '10')
,('28667', '掠夺舰操作', '257', '10')
,('28879', '纳米体操作技术', '1216', '2')
,('28880', '纳米体控制技术', '1216', '3')
,('29029', '战略货舰操作', '257', '14')
,('29637', '工业指挥舰操作', '257', '8')
,('30324', '防御子系统技术', '270', '5')
,('30325', '工程子系统技术', '270', '5')
,('30326', '电子子系统技术', '270', '5')
,('30327', '攻击子系统技术', '270', '5')
,('30532', '艾玛防御子系统', '1240', '1')
,('30536', '艾玛电子子系统', '1240', '1')
,('30537', '艾玛攻击子系统', '1240', '1')
,('30538', '艾玛推进子系统', '1240', '1')
,('30539', '艾玛工程子系统', '1240', '1')
,('30540', '盖伦特防御子系统', '1240', '1')
,('30541', '盖伦特电子子系统', '1240', '1')
,('30542', '加达里电子子系统', '1240', '1')
,('30543', '米玛塔尔电子子系统', '1240', '1')
,('30544', '加达里防御子系统', '1240', '1')
,('30545', '米玛塔尔防御子系统', '1240', '1')
,('30546', '盖伦特工程子系统', '1240', '1')
,('30547', '米玛塔尔工程子系统', '1240', '1')
,('30548', '加达里工程子系统', '1240', '1')
,('30549', '加达里攻击子系统', '1240', '1')
,('30550', '盖伦特攻击子系统', '1240', '1')
,('30551', '米玛塔尔攻击子系统', '1240', '1')
,('30552', '加达里推进子系统', '1240', '1')
,('30553', '盖伦特推进子系统', '1240', '1')
,('30554', '米玛塔尔推进子系统', '1240', '1')
,('30650', '艾玛战略巡洋舰操作', '257', '5')
,('30651', '加达里战略巡洋舰操作', '257', '5')
,('30652', '盖伦特战略巡洋舰操作', '257', '5')
,('30653', '米玛塔尔战略巡洋舰操作', '257', '5')
,('30788', '推进子系统技术', '270', '5')
,('32339', '铁骑轰炸机控制学', '273', '12')
,('32435', '堡垒级巡航导弹理论', '256', '7')
,('32797', '装甲抗性定相理论', '1210', '3')
,('32918', '采矿护卫舰操作', '257', '2')
,('32999', '磁力感应器补偿', '1213', '2')
,('33000', '引力感应器补偿', '1213', '2')
,('33001', '光雷达感应器补偿', '1213', '2')
,('33002', '雷达感应器补偿', '1213', '2')
,('33078', '装甲覆层理论', '1210', '3')
,('33091', '艾玛驱逐舰操作', '257', '2')
,('33092', '加达里驱逐舰操作', '257', '2')
,('33093', '盖伦特驱逐舰操作', '257', '2')
,('33094', '米玛塔尔驱逐舰操作', '257', '2')
,('33095', '艾玛战列巡洋舰操作', '257', '6')
,('33096', '加达里战列巡洋舰操作', '257', '6')
,('33097', '盖伦特战列巡洋舰操作', '257', '6')
,('33098', '米玛塔尔战列巡洋舰操作', '257', '6')
,('33399', '神经同步学', '1220', '2')
,('33407', '高级坚韧心理学', '1220', '5')
,('33467', '海关操作专业理论', '274', '2')
,('33699', '中型无人机操控理论', '273', '2')
,('33856', '勘探护卫舰', '257', '4')
,('34327', '联合矿业货舰操作', '257', '9')
,('34390', '艾玛战术驱逐舰操作', '257', '3')
,('34533', '米玛塔尔战术驱逐舰操作', '257', '3')
,('35680', '加达里战术驱逐舰操作', '257', '3')
,('35685', '盖伦特战术驱逐舰操作', '257', '3');

-- ----------------------------
-- Records of django_content_type
-- ----------------------------
INSERT INTO `django_content_type` VALUES ('1', 'permission', 'auth', 'permission');
INSERT INTO `django_content_type` VALUES ('2', 'group', 'auth', 'group');
INSERT INTO `django_content_type` VALUES ('3', 'user', 'auth', 'user');
INSERT INTO `django_content_type` VALUES ('4', 'content type', 'contenttypes', 'contenttype');
INSERT INTO `django_content_type` VALUES ('5', 'session', 'sessions', 'session');
INSERT INTO `django_content_type` VALUES ('6', 'site', 'sites', 'site');
INSERT INTO `django_content_type` VALUES ('7', 'log entry', 'admin', 'logentry');
INSERT INTO `django_content_type` VALUES ('8', 'skill group', 'datas', 'skillgroup');
INSERT INTO `django_content_type` VALUES ('9', 'skill', 'datas', 'skill');
INSERT INTO `django_content_type` VALUES ('10', '账号', 'datas', 'account');
INSERT INTO `django_content_type` VALUES ('11', '角色', 'datas', 'character');
INSERT INTO `django_content_type` VALUES ('12', '角色技能', 'datas', 'character_skills');

-- ----------------------------
-- Records of django_site
-- ----------------------------
INSERT INTO `django_site` VALUES ('1', 'example.com', 'example.com');

-- Implant
-- 	SELECT
-- 		',(''' + s.[text] + ''', ''' + CAST (s.languageID AS VARCHAR) + ''', ''' + CAST (a1.valueInt AS VARCHAR) + ''', ''' + CAST (a2.valueInt AS VARCHAR) + ''', ''' + CAST (t.typeID AS VARCHAR) + ''')' AS insert_sql
-- 	FROM
-- 		invTypes t
-- 	INNER JOIN trnTranslations s ON (
-- 		t.typeID = s.keyID
-- 		AND s.tcID = 8
-- 	)
-- 	INNER JOIN dgmTypeAttributes a1 ON (
-- 		t.typeID = a1.typeID
-- 		AND a1.attributeID = 331
-- 	) -- 331: implant type
-- 	INNER JOIN dgmTypeAttributes a2 ON (
-- 		t.typeID = a2.typeID
-- 		AND a2.attributeID IN (175, 176, 177, 178, 179)
-- 		AND a2.valueInt > 0
-- 	) -- 175-179: implant value
-- 	WHERE
-- 		t.groupID = 745 -- implant
-- 	AND s.languageID IN ('ZH', 'EN-US')
-- 	ORDER BY
-- 		s.languageID DESC,
-- 		a1.valueInt,
-- 		a2.valueInt
INSERT INTO datas_implant (implant_name, languageID, implant_type, implant_value, type_id) VALUES 
 ('初级视觉滤镜', 'ZH', '1', '1', '13283')
,('初级视觉滤镜—加强版', 'ZH', '1', '2', '14295')
,('视觉滤镜—基础级', 'ZH', '1', '3', '9899')
,('视觉滤镜—标准级', 'ZH', '1', '4', '10216')
,('视觉滤镜—强化级', 'ZH', '1', '5', '10217')
,('视觉滤镜—高级', 'ZH', '1', '6', '10218')
,('视觉滤镜—精英级', 'ZH', '1', '7', '10219')
,('初级记忆增强体', 'ZH', '2', '1', '13284')
,('初级记忆增强体—加强版', 'ZH', '2', '2', '14297')
,('记忆增强体—基础级', 'ZH', '2', '3', '9941')
,('记忆增强体—标准级', 'ZH', '2', '4', '10208')
,('记忆增强体—强化级', 'ZH', '2', '5', '10209')
,('记忆强植体—高级', 'ZH', '2', '6', '10210')
,('记忆增强体—精英级', 'ZH', '2', '7', '10211')
,('初级神经增效体', 'ZH', '3', '1', '13285')
,('初级神经增效体—加强版', 'ZH', '3', '2', '14296')
,('神经增效体—基础级', 'ZH', '3', '3', '9942')
,('神经增效体—标准级', 'ZH', '3', '4', '10212')
,('神经增效体—强化级', 'ZH', '3', '5', '10213')
,('神经增效体—高级', 'ZH', '3', '6', '10214')
,('神经增效体—精英级', 'ZH', '3', '7', '10215')
,('初级脑控次处理器', 'ZH', '4', '1', '13287')
,('初级脑控次处理器—加强版', 'ZH', '4', '2', '14298')
,('脑控次处理器—基础级', 'ZH', '4', '3', '9943')
,('脑控次处理器—标准级', 'ZH', '4', '4', '10221')
,('脑控次处理器—强化级', 'ZH', '4', '5', '10222')
,('脑控次处理器—高级', 'ZH', '4', '6', '10223')
,('脑控次处理器—精英级', 'ZH', '4', '7', '10224')
,('初级社交适应芯片', 'ZH', '5', '1', '13286')
,('初级社交适应芯片—加强版', 'ZH', '5', '2', '14299')
,('社交适应芯片—基础级', 'ZH', '5', '3', '9956')
,('社交适应芯片—标准级', 'ZH', '5', '4', '10225')
,('社交适应芯片—强化级', 'ZH', '5', '5', '10226')
,('社交适应芯片—高级', 'ZH', '5', '6', '10227')
,('Limited Ocular Filter', 'EN-US', '1', '1', '13283')
,('Limited Ocular Filter - Beta', 'EN-US', '1', '2', '14295')
,('Ocular Filter - Basic', 'EN-US', '1', '3', '9899')
,('Ocular Filter - Standard', 'EN-US', '1', '4', '10216')
,('Ocular Filter - Improved', 'EN-US', '1', '5', '10217')
,('Ocular Filter - Advanced', 'EN-US', '1', '6', '10218')
,('Ocular Filter - Elite', 'EN-US', '1', '7', '10219')
,('Limited Memory Augmentation', 'EN-US', '2', '1', '13284')
,('Limited Memory Augmentation - Beta', 'EN-US', '2', '2', '14297')
,('Memory Augmentation - Basic', 'EN-US', '2', '3', '9941')
,('Memory Augmentation - Standard', 'EN-US', '2', '4', '10208')
,('Memory Augmentation - Improved', 'EN-US', '2', '5', '10209')
,('Memory Augmentation - Advanced', 'EN-US', '2', '6', '10210')
,('Memory Augmentation - Elite', 'EN-US', '2', '7', '10211')
,('Limited Neural Boost', 'EN-US', '3', '1', '13285')
,('Limited Neural Boost - Beta', 'EN-US', '3', '2', '14296')
,('Neural Boost - Basic', 'EN-US', '3', '3', '9942')
,('Neural Boost - Standard', 'EN-US', '3', '4', '10212')
,('Neural Boost - Improved', 'EN-US', '3', '5', '10213')
,('Neural Boost - Advanced', 'EN-US', '3', '6', '10214')
,('Neural Boost - Elite', 'EN-US', '3', '7', '10215')
,('Limited Cybernetic Subprocessor', 'EN-US', '4', '1', '13287')
,('Limited Cybernetic Subprocessor - Beta', 'EN-US', '4', '2', '14298')
,('Cybernetic Subprocessor - Basic', 'EN-US', '4', '3', '9943')
,('Cybernetic Subprocessor - Standard', 'EN-US', '4', '4', '10221')
,('Cybernetic Subprocessor - Improved', 'EN-US', '4', '5', '10222')
,('Cybernetic Subprocessor - Advanced', 'EN-US', '4', '6', '10223')
,('Cybernetic Subprocessor - Elite', 'EN-US', '4', '7', '10224')
,('Limited Social Adaptation Chip', 'EN-US', '5', '1', '13286')
,('Limited Social Adaptation Chip - Beta', 'EN-US', '5', '2', '14299')
,('Social Adaptation Chip - Basic', 'EN-US', '5', '3', '9956')
,('Social Adaptation Chip - Standard', 'EN-US', '5', '4', '10225')
,('Social Adaptation Chip - Improved', 'EN-US', '5', '5', '10226')
,('Social Adaptation Chip - Advanced', 'EN-US', '5', '6', '10227');

-- ----------------------------
-- Records of datas_character_skills
-- ----------------------------
INSERT INTO `datas_character_skills` VALUES ('1', '1', '3319', '1', '250');

